Autodesk.Revit.DB.FabricationServiceButton.GetProfileType(System.Int32,System.Int32)
Gets the profile type of the passed condition index. If there are multiple profile types, this will return invalid.
condition:
If the condition index is -1 and there is a mixture of profile types, this will return invalid.
connectorIndex:
If the connector index is -1 and there is a mixture of profile types, this will return invalid.
Since:
2016

Autodesk.Revit.DB.FabricationServiceButton.GetIsProductList(System.Int32)
Checks to see if the passed condition index is a product listed, or catalogue item or not.
condition:
If the condition index is -1 and there is a mixture of product list and non-product list, this will return false.
Since:
2016

Autodesk.Revit.DB.FabricationServiceButton.GetDomain(System.Int32)
Gets the domain type for the passed condition index.
condition:
If the condition index is -1 and there are mixed domains, this will return undefined.
Since:
2016

Autodesk.Revit.DB.FabricationServiceButton.IsSizeValidForCondition(System.Int32,System.Double,System.Double)
Checks if the condition is valid for specified size.
condition:
The condition index.
widthOrDiameter:
The width/diameter of the size to check
depth:
The depth of the size to check
Returns:
True if the condition is valid
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
the index condition is not larger or equal to 0 and less than ConditionCount
Since:
2016

Autodesk.Revit.DB.FabricationServiceButton.ContainsFabricationPartType(Autodesk.Revit.DB.FabricationPartType)
Checks to see if the fabrication part type exists on one of the button conditions.
partType:
The fabrication part type to check.
Returns:
Returns true if the fabrication part type exists on the fabrication service button.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016 Subscription Release

Autodesk.Revit.DB.FabricationServiceButton.GetConditionName(System.Int32)
Gets the name of the specified condition on the fabrication service button.
condition:
The condition index.
Returns:
The name of the specified condition on the fabrication service button.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
the index condition is not larger or equal to 0 and less than ConditionCount
Since:
2016

Autodesk.Revit.DB.FabricationServiceButton.IsExcluded
Gets if the button's fabrication part content associated with the button is to be excluded from Route and Fill, Design to Fabrication, or Multi Point Routing commands.
Returns:
Returns true if the button's parts are excluded.
Since:
2017 Subscription Update

Autodesk.Revit.DB.FabricationServiceButton.IsValid
Checks if the button contains only valid fittings.
Returns:
True if the button contains only valid fittings.
Since:
2016

Autodesk.Revit.DB.FabricationServiceButton.IsUnrestrictedCondition(System.Int32)
Checks if the condition is unrestricted.
condition:
The condition index.
Returns:
True if the condition is unrestricted.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
the index condition is not larger or equal to 0 and less than ConditionCount
Since:
2016

Autodesk.Revit.DB.FabricationServiceButton.GetConditionUpperValue(System.Int32)
Gets the condition upper value (valid if less) for a given condition index.
Remarks:
A value of -1 indicates an unrestricted value.
condition:
The condition index.
Returns:
The condition upper value.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
the index condition is not larger or equal to 0 and less than ConditionCount
Since:
2016

Autodesk.Revit.DB.FabricationServiceButton.GetConditionLowerValue(System.Int32)
Gets the condition lower value (valid if greater or equal) for a given condition index.
Remarks:
A value of -1 indicates an unrestricted value.
condition:
The condition index.
Returns:
The condition lower value.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
the index condition is not larger or equal to 0 and less than ConditionCount
Since:
2016

Autodesk.Revit.DB.FabricationServiceButton.GetConditionDescription(System.Int32)
Gets the description for the condition size range.
condition:
The index of the condition in the service button.
Returns:
A user-defined string that describes the condition range, as defined in the fabrication configuration.
For example, this may describe the size of the range or describe the type of fitting.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
the index condition is not larger or equal to 0 and less than ConditionCount
Since:
2017

Autodesk.Revit.DB.FabricationServiceButton.IsValidConditionIndex(Autodesk.Revit.DB.FabricationServiceButton,System.Int32)
Validates if the given condition index is valid or not.
button:
The button to check.
condition:
The condition index.
Returns:
True if larger or equal to 0 and less than ConditionCount.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.FabricationServiceButton.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.FabricationServiceButton.IsStraight
Checks if all of the fabrication service button conditions are straights.
Since:
2016

Autodesk.Revit.DB.FabricationServiceButton.IsAHanger
Checks if the fabrication service button is hanger.
Since:
2016

Autodesk.Revit.DB.FabricationServiceButton.ButtonIndex
The button index for this button.
Since:
2016

Autodesk.Revit.DB.FabricationServiceButton.GroupIndex
The group index for this button.
Since:
2016

Autodesk.Revit.DB.FabricationServiceButton.ServiceId
The fabrication service identifier for the fabrication service this button belongs to.
Since:
2016

Autodesk.Revit.DB.FabricationServiceButton.ConditionIndex
The index of the condition being used.
Since:
2016

Autodesk.Revit.DB.FabricationServiceButton.ConditionCount
The number of conditions.
Since:
2016

Autodesk.Revit.DB.FabricationServiceButton.Code
The code of the button.
Since:
2016

Autodesk.Revit.DB.FabricationServiceButton.Name
The name of the button.
Since:
2016

Autodesk.Revit.DB.FabricationServiceButton.GetConditionImage(System.Int32!System.Runtime.CompilerServices.IsConst)
Gets the image for the specified fabrication service button condition.
condition: The condition index.
Returns: System.Drawing.Bitmap represents the fabrication service button image. null if there is no preview image.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
the index condition is not larger or equal to 0 and less than ConditionCount
Since: 2016

Autodesk.Revit.DB.FabricationServiceButton.GetImage
Gets the image for fabrication service button.
Returns: System.Drawing.Bitmap represents the fabrication service button image. null if there is no preview image.
Since: 2016

Autodesk.Revit.DB.FabricationServiceButton
The object contains information about a fabricaton button.
Remarks:
A fabrication service button defines what items to use for different conditions. Fabrication service buttons are part of a fabrication service.
Since:
2016